In [2]:
import numpy as np
import pandas as pd

In [9]:
students_performance = pd.read_csv('Data/students_performance.csv', sep=',')

In [10]:
students_performance.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [12]:
students_performance.shape

(1000, 8)

In [14]:
students_performance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [15]:
students_performance.describe(include='object')

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,2,5,6,2,2
top,female,group C,some college,standard,none
freq,518,319,226,645,642

In [19]:
students_performance.describe().loc[:, ['math score', 'reading score', 'writing score']]

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [22]:
students_performance.loc[155, 'writing score']

88

In [25]:
students_performance['writing score'].mean()

68.054

In [26]:
students_performance[(students_performance['test preparation course'] == 'completed')]['reading score'].mean()

73.89385474860335

In [27]:
students_performance[(students_performance['math score'] == 0)].shape[0]

1

In [34]:
mask1 = students_performance['lunch'] == 'standard'
mask2 = students_performance['lunch'] == 'free/reduced'
mean_paid = students_performance[mask1]['math score'].mean()
mean_reduced = students_performance[mask2]['math score'].mean()
mean_paid > mean_reduced
print(round(mean_paid), round(mean_reduced))

70 59

In [40]:
students_parents_bachelor = students_performance[students_performance['parental level of education'] == "bachelor's degree"].shape[0]
students_performance['parental level of education'].value_counts(normalize=True)*100

parental level of education
some college          22.6
associate's degree    22.2
high school           19.6
some high school      17.9
bachelor's degree     11.8
master's degree        5.9
Name: proportion, dtype: float64

In [52]:
mask_race_A = students_performance[students_performance['race/ethnicity'] == 'group A']
mask_race_C = students_performance[students_performance['race/ethnicity'] == 'group C']
mask_race_A_median = students_performance[students_performance['race/ethnicity'] == 'group A']['writing score'].median() 
mask_race_C_mean = students_performance[students_performance['race/ethnicity'] == 'group C']['writing score'].mean()
mask_difference = mask_race_A_median-mask_race_C_mean
print(mask_difference)

-5.827586206896555